#Напишите программу для нахождения третьей стороны прямоугольного треугольника по двум известным сторонам.
#!/usr/bin/env python3
import math

if __name__ == '__main__':
    def pufagor():
        vybor = input('Выбери один из двух вариантов:\n 1. Найти гипотенузу (даны два катета)\n 2. Найти катет (дана гипотенуза и катет)\n')
        if vybor == '1':
            a = float(input('Введите значение первого катета:'))
            b = float(input('Введите значение второго катета'))
            if a<= 0 or b <= 0:
                print("Будь внимательнее! Числа должны быть положительными!")
                return
            c = math.sqrt((a*a)+(b*b))
            print(f'Ваша искомая гипотенуза равна: {c}')
        elif vybor == '2':
            c = float(input('Введите значение гипотенузы:'))
            a = float(input('Введите значение известного катета:'))
            if a<= 0 or c<=0:
                print('Будь внимательнее! числа должны быть положительными!!')
                return
            if a>= c:
                print('Плохо! Катет не может быть больше или равен гипотенузе!')
                return
            b = math.sqrt((c*c)-(a*a))
            print(f'Вот значение искомого катета:{b}')
        else:
            print('Вы явно выбрали чтото не то....')

    pufagor()